# Construction Properties

---
The Construction type exposes the following members.
| Name| Description
---|---|---
| Id| Get the id of the Construction.
| Name| Get the name of the Construction.
Top
#### Reference
Construction Class
Autodesk.Revit.DB Namespace